//Задание 1:
// 1. Установить расширение форматирования кода “Prettier”: https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode
// Если не загружается, можно скачать здесь: https://open-vsx.org/extension/esbenp/prettier-vscode
// 2. Установить расширение “JavaScript Snippet Pack”: https://marketplace.visualstudio.com/items?itemName=akamud.vscode-javascript-snippet-pack
// Если не загружается, можно скачать здесь: https://disk.yandex.ru/d/ktnuTXmnzVEUCw
// 3. Создайте файлы для вашей первой программы: index.html и script.js.
// 4. Подключите файл `script.js` к `index.html`.
// 5. В файле script.js выведите в консоль текст “Текст из script.js!”.
// 6. В файле `index.html` создайте скрипт (без подключения отдельного js-файла), который выводет в консоль текст “Текст из index.html”.
// 7. Проверьте работоспособность кода.

// Выполнение
// console.log("Текст из script.js!");

// Задание 2:
// 1. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной в консоль.
// 2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.
// 3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.
// 4. Создайте два вида комментариев в вашем коде, добавьте в них произвольный текст.
// Тайминг: 20 минут.

// выполнение
// let num = 123;
// console.log(num);

// let a = 5;
// a = 7;
// console.log(a);

// let b = 1 + 2 + 3;
// console.log(b);

// const n = 222;
// console.log(n);
// n = 333;
// console.log(n);


// задание 3
// 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год (все созданные переменные должны быть логично названы).
const myAge = 34;
const thisYear = 2024;
// - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
const mySum = myAge + thisYear;
// - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
const dif = thisYear - myAge;
// - Создайте переменную произведения и присвойте произведение чисел двух переменных.
const mult = thisYear * myAge;
// - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.
const div = thisYear / myAge;
// 2. Выведите в консоль все созданные переменные.
console.log("Summ: ", mySum, "Dif: ", dif, "Mult: ", mult, "Div: ", div);
// 3. Сложите все созданные переменные и выведите результат в консоль.
console.log( mySum + dif + mult + div);


// Задание 4: 
// Не запуская код, определите, что отобразится в консоли: 
// `let a = 5 + 5 * 3 + 3;` 23
// Не запуская код, определите, что отобразится в консоли:
// `let b = 8 / 2 + 2;` 6
// Не запуская код, определите, что отобразится в консоли:
// `let c = (2 + 3) * (2 + 3);` 25
// Не запуская код, определите, что отобразится в консоли:
// `let d = (2 + 3) * 2 + 3;` 13
// Не запуская код, определите, что отобразится в консоли:
// `let e = (2 * 8) / 4;` 4
// Не запуская код, определите, что отобразится в консоли:
// `let f = 2 * (8 / 4);` 4

